snlkuharlocal/src/DataProcessors/КонтрольКоличестваЗаказовФБС/КонтрольКоличестваЗаказовФБС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтрольКоличестваЗаказовФБС</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусФоновогоЗадания/СтатусФоновогоЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусФоновогоЗадания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Занято</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтопВыгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Загружено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтопДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КОД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПроцедуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ЗаказКлиентаFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаFBS</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистПереукладки</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/КонтрольКоличестваЗаказовФБС/ObjectModule.bsl
//Шаблон балванка для регламентного задания

Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт  
	
	
	Если   ПараметрыСеанса.ТипУзла= Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ЭтоОФИС=Истина;
	Иначе
		ЭтоОФИС=Ложь;
	КонецЕсли;

	Принудиловка = 	Дата(1,1,1);
			
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("День1",0);   //Понедельник                  
	СтруктураПараметров.Вставить("День2",0);   //Вторник     
	СтруктураПараметров.Вставить("День3",0);   //Среда
	СтруктураПараметров.Вставить("День4",0);   //Четверг      
    СтруктураПараметров.Вставить("День5",0);   //Пятница    
    СтруктураПараметров.Вставить("День6",0);   //суббота      
    СтруктураПараметров.Вставить("День7",0);   //воскресенье
	
	Если ТаблицаПараметров=Неопределено Тогда 
		
		КодМаркетплейса ="00001";
		МаркПл =Справочники.ИнетМагазины.НайтиПоКоду(КодМаркетплейса);
		МаксимумЗаданий = МаркПл.МаксКоличествоЗаказов;
		// Ихсанов Д. А. Начало 06.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2235
		КодСтатусаЗадания   = ""; // Код статуса для поиска данных по заданию
		ИмяПроцедурыЗадания = ""; // Имя процедуры для поиска данных по заданию
		// Ихсанов Д. А. Конец  06.04.2025
		
	Иначе
		ПоискКода=ТаблицаПараметров.Найти("МаркетПлейс","Имя");
		
		Если ЗначениеЗаполнено(ПоискКода.Значение) Тогда
			
			МаркПл =Справочники.ИнетМагазины.НайтиПоКоду(ПоискКода.Значение);
			
			Если МаркПл=Справочники.ИнетМагазины.ПустаяСсылка() Тогда
				Возврат;
			КонецЕсли;
			
			КодМаркетплейса = ПоискКода.Значение; 			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
		// Ихсанов Д. А. Начало 16.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2519
		// Получим параметр для выявления необходимости уведомлять об изменении витрины
		НаборЗаписейНастройкаПоОтбивке = РегистрыСведений.РеквизитыСправочников.СоздатьМенеджерЗаписи();
		НаборЗаписейНастройкаПоОтбивке.Справочник = МаркПл;
		НаборЗаписейНастройкаПоОтбивке.ИмяРеквизита = "УведомлятьОбИзмененииВитрины";
		НаборЗаписейНастройкаПоОтбивке.Прочитать();
		
		УведомлятьОбИзмененииВитрины = Ложь;
		Если НаборЗаписейНастройкаПоОтбивке.Выбран() Тогда
			Если ТипЗнч(НаборЗаписейНастройкаПоОтбивке.ЗначениеРеквизита) = Тип("Булево") Тогда
				УведомлятьОбИзмененииВитрины = НаборЗаписейНастройкаПоОтбивке.ЗначениеРеквизита
			КонецЕсли
		КонецЕсли;
		
		// Получим список получателей при изменении витрины
		СписокПолучателейУведомленийОбИзмененииВитрины = Новый СписокЗначений;
		Если УведомлятьОбИзмененииВитрины Тогда
			НаборЗаписейНастройкаПоОтбивке.Справочник = МаркПл;
			НаборЗаписейНастройкаПоОтбивке.ИмяРеквизита = "ПолучателиУведомленийВитрина";
			НаборЗаписейНастройкаПоОтбивке.Прочитать();
			
			Если НаборЗаписейНастройкаПоОтбивке.Выбран() Тогда
				Если ТипЗнч(НаборЗаписейНастройкаПоОтбивке.ЗначениеРеквизита) = Тип("Строка") Тогда
					СписокПолучателейУведомленийОбИзмененииВитрины.ЗагрузитьЗначения(
						СтрРазделить(НаборЗаписейНастройкаПоОтбивке.ЗначениеРеквизита, ","))
				КонецЕсли
			КонецЕсли
		КонецЕсли;
		// Ихсанов Д. А. Конец 16.10.2025
		
		//есть ограничение на количество заказов
		МаксимумЗаданий = МаркПл.МаксКоличествоЗаказов;

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("День1",МаксимумЗаданий);   //Понедельник
		СтруктураПараметров.Вставить("День2",МаксимумЗаданий);   //Вторник     
		СтруктураПараметров.Вставить("День3",МаксимумЗаданий);   //Среда
		СтруктураПараметров.Вставить("День4",МаксимумЗаданий);   //Четверг      
		СтруктураПараметров.Вставить("День5",МаксимумЗаданий);   //Пятница    
		СтруктураПараметров.Вставить("День6",МаксимумЗаданий);   //суббота      
		СтруктураПараметров.Вставить("День7",МаксимумЗаданий);   //воскресенье
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл 
			
			Для Сч=1 по 7 Цикл
				
				Если Нрег(СтрокаТП.Имя) = "день"+Строка(сч) Тогда			
					СтруктураПараметров.Вставить("День"+Строка(сч),СтрокаТП.Значение);   //Понедельник
				КонецЕсли;	
				
			КонецЦикла;
			
			// Ихсанов Д. А. Начало 06.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2235
			// Инициализируем параметры для работы ограничения регламентного задания по времени
			Если СтрокаТП.Имя = "КодСтатусаЗадания" Тогда			
				КодСтатусаЗадания = СтрокаТП.Значение;
			ИначеЕсли СтрокаТП.Имя = "ИмяПроцедурыЗадания" Тогда			
				ИмяПроцедурыЗадания = СтрокаТП.Значение;
			КонецЕсли;
			// Ихсанов Д. А. Конец  06.04.2025
			
		КонецЦикла;  
		
		
		ПоискПринудительнойОстановки=ТаблицаПараметров.Найти("Остановка","Имя");
		
		Принудиловка = 	Дата(1,1,1);
		
		Если ПоискПринудительнойОстановки<>Неопределено Тогда
			
			Если ЗначениеЗаполнено(ПоискПринудительнойОстановки.Значение) Тогда
				Попытка
					Принудиловка = 	ПоискПринудительнойОстановки.Значение;			
				исключение
					Принудиловка = 	Дата(1,1,1);   
				КонецПопытки;			    			
			КонецЕсли;
						
		КонецЕсли;  		
		
	КонецЕсли;
	
	// Ихсанов Д. А. Начало 06.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2235
	// Выполним проверку на возможность запуска механизма
	ВыполнениеРазрешено = Истина;
	Если ЗначениеЗаполнено(КодСтатусаЗадания)
		И ЗначениеЗаполнено(ИмяПроцедурыЗадания) Тогда
		СтруктураДанныхЗадания = Новый Структура;
		СтруктураДанныхЗадания.Вставить("Код",   		КодСтатусаЗадания);
		СтруктураДанныхЗадания.Вставить("ИмяПроцедуры", ИмяПроцедурыЗадания);
		
		ВыполнениеРазрешено = ОбменМаркетПлейс.ПроверкаРазрешенияНаЗапускРегламентногоЗадания(СтруктураДанныхЗадания,
			Истина);
	КонецЕсли;
	
	// Если не можем выполнить регламентное, возвращаемся
	Если Не ВыполнениеРазрешено Тогда
		Возврат
	КонецЕсли;
	// Ихсанов Д. А. Конец  06.04.2025
		

	Если КодМаркетплейса ="00001" или КодМаркетплейса ="00009" или КодМаркетплейса ="00016" //Тогда
		Или КодМаркетплейса = "00002" //Тогда // ОЗОН
		// Ихсанов Д. А. Начало 01.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2125
		Или КодМаркетплейса = "00004" //Тогда // Яндекс
		Или КодМаркетплейса = "00014" Тогда // Магнит
		// Ихсанов Д. А. Конец 01.04.2025

				
		//это методы Валдбериз  		
			
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СтатусФоновогоЗаданияСрезПоследних.Период       КАК Период,
		|	СтатусФоновогоЗаданияСрезПоследних.КОД          КАК КОД,
		|	СтатусФоновогоЗаданияСрезПоследних.ИмяПроцедуры КАК ИмяПроцедуры,
		|	СтатусФоновогоЗаданияСрезПоследних.Занято       КАК Занято,
		|	СтатусФоновогоЗаданияСрезПоследних.СтопВыгрузка КАК СтопВыгрузка,
		|	СтатусФоновогоЗаданияСрезПоследних.Загружено    КАК Загружено,
		|	СтатусФоновогоЗаданияСрезПоследних.СтопДата     КАК СтопДата
		|ИЗ
		|	РегистрСведений.СтатусФоновогоЗадания.СрезПоследних КАК СтатусФоновогоЗаданияСрезПоследних
		|ГДЕ
		|	СтатусФоновогоЗаданияСрезПоследних.КОД = &КОД";
		//Параметры запроса
		Запрос.УстановитьПараметр("КОД",МаркПл.Код);// Строка
		Результат = Запрос.Выполнить().Выбрать();
		
		//есть ограничение на количество заказов
		МаксимумЗаданий = СтруктураПараметров["День"+Строка(ДеньНедели(ТекущаяДата()))];
		
		//если есть запись
		Если Результат.Следующий() Тогда
			
			//обнуление остатков по указанной дате и времени
			
			Если Принудиловка <> Дата(1,1,1) и (ТекущаяДатаСеанса()>Принудиловка и Принудиловка<КонецДня(ТекущаяДатаСеанса())) Тогда  				
				
				НаборЗаписей = РегистрыСведений.СтатусФоновогоЗадания.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.КОД.Установить(Результат.Код);
				НаборЗаписей.Отбор.ИмяПроцедуры.Установить(Результат.ИмяПроцедуры);	
				НаборЗаписей.Прочитать();
				
				Для каждого НовЗап из НаборЗаписей Цикл
					// Ихсанов Д. А. Начало 16.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2519
					ФлагСтопВыгрузка = НовЗап.СтопВыгрузка;
					// Ихсанов Д. А. Конец 16.10.2025
					
					Если НовЗап.СтопВыгрузка = Ложь Тогда 	
						
						НовЗап.СтопВыгрузка     = Истина;
						НовЗап.СтопДата         = ТекущаяДатаСеанса();
						НовЗап.Загружено        = 0;
						НаборЗаписей.Записать();
						
						ЗаписатьВЛог("МаркетПлейс_контроль заказов",Строка(КодМаркетплейса)+" ПРИНУДИТЕЛЬНАЯ СТОП ВЫГРУЗКА- по времени  "+Строка(Принудиловка),"Информация");
						
						//запустим обнуление остатков если СТОПВЫГРУЗКА =ИСТИНА, то все с 0 выгрузятся
						
						ВыгрузкаОстатковнаВитрину(МаркПл,КодМаркетплейса);
						
						// Ихсанов Д. А. Начало 06.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2235
						// Зафиксируем условный результат выполнения регламента
						Если ЗначениеЗаполнено(КодСтатусаЗадания) И ЗначениеЗаполнено(ИмяПроцедурыЗадания) Тогда
							СтруктураДанныхЗадания.Вставить("СтопДата", КонецДня(ТекущаяДатаСеанса()) + 1);
							ОбменМаркетПлейс.ПроверкаРазрешенияНаЗапускРегламентногоЗадания(СтруктураДанныхЗадания, Истина);
						КонецЕсли;
						// Ихсанов Д. А. Конец  06.04.2025
						
					КонецЕсли;  
					
					// Ихсанов Д. А. Начало 16.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2519
					Если ФлагСтопВыгрузка <> НовЗап.СтопВыгрузка
						И СписокПолучателейУведомленийОбИзмененииВитрины.Количество() > 0 Тогда
						ТемаУведомления = СтрШаблон("%1. Информация по обновлению витрины.", МаркПл.Наименование);
						Если НовЗап.СтопВыгрузка Тогда
							СообщениеУведомления = СтрШаблон("Витрина по маркет плейсу %1 выключена по причине:
							|Достижение даты принудительного обнуления витрины.", МаркПл.Наименование)
						Иначе
							СообщениеУведомления = СтрШаблон("Витрина по маркет плейсу %1 включена!", МаркПл.Наименование)
						КонецЕсли;
						
						ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателейУведомленийОбИзмененииВитрины,
							ТемаУведомления, СообщениеУведомления);
					КонецЕсли;
					// Ихсанов Д. А. Конец 16.10.2025
					
				КонецЦикла; 
				
				Возврат;
				
			КонецЕсли;    
			               			
			//если сняты ограничения
			
			Если МаксимумЗаданий>0 Тогда    							
				
				НаборЗаписей = РегистрыСведений.СтатусФоновогоЗадания.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.КОД.Установить(Результат.Код);
				НаборЗаписей.Отбор.ИмяПроцедуры.Установить(Результат.ИмяПроцедуры);	
				НаборЗаписей.Прочитать();
				
				Для каждого НовЗап из НаборЗаписей Цикл
					
					// Ихсанов Д. А. Начало 16.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2519
					ФлагСтопВыгрузка = НовЗап.СтопВыгрузка;
					// Ихсанов Д. А. Конец 16.10.2025
					
					//и обновим данные
					
					//если это прошлые записи - не сегодня  обнулим стоп дату
					
					Если Результат.СтопДата    <>  Дата(1,1,1) Тогда
						
						Если НачалоДня(Результат.СтопДата) < НачалоДня(ТекущаяДатаСеанса()) Тогда
							
							НовЗап.СтопДата     =  Дата(1,1,1);
							НовЗап.СтопВыгрузка =  Ложь;
							НовЗап.Загружено    =  0;
							
						КонецЕсли;
						
					КонецЕсли;
					
					
					Если КодМаркетплейса ="00001" или КодМаркетплейса ="00009" или КодМаркетплейса ="00016" Тогда //ВАЙЛБЕРИЗ
						//с сайта
						КолвоНовых           = ОбменМаркетПлейс.МП_Вайлдберриз_КонтрольКоличестваЗаказов(МаркПл);
					ИначеЕсли КодМаркетплейса ="00002" Тогда  //ОЗОН	
						
						КолвоНовых           = ОбменМаркетПлейс.МП_ОЗОН_КонтрольКоличестваЗаказов(МаркПл);
										
					ИначеЕсли КодМаркетплейса = "00004" Тогда //ЯНДЕКС
						// Ихсанов Д. А. Начало 01.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2125
						КолвоНовых = ОбменМаркетПлейс.МП_ЯндексМаркет_КонтрольКоличестваЗаказов(МаркПл);
						// Ихсанов Д. А. Конец 01.04.2025
					ИначеЕсли КодМаркетплейса = "00014" Тогда //МАГНИТ
						// Ихсанов Д. А. Начало 01.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2067
						КолвоНовых = ОбменМаркетПлейс.МП_МагнитМаркет_КонтрольКоличестваЗаказов(МаркПл);
						// Ихсанов Д. А. Конец 01.04.2025						
					КонецЕсли;
					
					//из базы получим	
					УжеЗагруженныеЗаказы = ВсегоЗаказовЗаСегодня(МаркПл);
					
					//всего заказов
					ВсегоЗаказов         = УжеЗагруженныеЗаказы + КолвоНовых;
					
					НовЗап.Загружено     = ВсегоЗаказов;
					
					//если ВСЕГО ЗАКАЗОВ больше положенного порога
					
					Если ВсегоЗаказов>=МаксимумЗаданий Тогда  						
						
						Если НовЗап.СтопВыгрузка = Ложь Тогда
							ЗаписатьВЛог("МаркетПлейс_контроль заказов",Строка(КодМаркетплейса)+" Заданий "+Строка(МаксимумЗаданий)+"- СТОП ВЫГРУЗКА "+Строка(КолвоНовых)+" + "+Строка(УжеЗагруженныеЗаказы)+" = "+Строка(ВсегоЗаказов),"Информация");
						КонецЕсли;
						
						НовЗап.СтопВыгрузка = Истина; 						
						//и стоп дата ПУСТАЯ
						Если Результат.СтопДата     =  Дата(1,1,1) Тогда  					
																					
							НовЗап.СтопДата         = ТекущаяДатаСеанса();
							НаборЗаписей.Записать();
							
							//запустим обнуление остатков если СТОПВЫГРУЗКА =ИСТИНА, то все с 0 выгрузятся
																					
							ВыгрузкаОстатковнаВитрину(МаркПл,КодМаркетплейса);
							
							// Ихсанов Д. А. Начало 06.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2235
							// Зафиксируем условный результат выполнения регламента
							Если ЗначениеЗаполнено(КодСтатусаЗадания) И ЗначениеЗаполнено(ИмяПроцедурыЗадания) Тогда
								СтруктураДанныхЗадания.Вставить("СтопДата", КонецДня(ТекущаяДатаСеанса()) + 1);
								ОбменМаркетПлейс.ПроверкаРазрешенияНаЗапускРегламентногоЗадания(СтруктураДанныхЗадания, Истина);
							КонецЕсли;
							// Ихсанов Д. А. Конец  06.04.2025
							
							//нужно кому то сообщить что обнулили остатки на портале !
							
							//Попытка
							//	
							//	Сооб="Витрина - "+Строка(КодМаркетплейса)+" Заданий "+Строка(МаксимумЗаданий)+"- загружено заказов - "+СТрока(ВсегоЗаказов)+ " проверьте остатки на сайте";
							//	
							//	СписокПолучателей=новый СписокЗначений;
							//									
							//	СписокПолучателей.Добавить("timofeev@collant.ru");   //пока на время теста только мне						
							//	
							//	ТекстОповещения="Здравствуйте!"+Символы.ПС+Сооб;
							//	ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателей,НСтр("ru='Витрина -колво заказов'")+Формат(ТекущаяДатаСеанса(),"ДФ='dd.MM.yyyy чч:мм'"),ТекстОповещения);   
							//Исключение
							//	ЗаписатьВЛог("МаркетПлейс_контроль заказов_Ош",Строка(КодМаркетплейса)+" "+ОписаниеОшибки(),"Ошибка");
							//	
							//КонецПопытки;
						КонецЕсли;
						
						// Ихсанов Д. А. Начало 16.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2519
						Если ФлагСтопВыгрузка <> НовЗап.СтопВыгрузка
							И СписокПолучателейУведомленийОбИзмененииВитрины.Количество() > 0 Тогда
							ТемаУведомления = СтрШаблон("%1. Информация по обновлению витрины.", МаркПл.Наименование);
							Если НовЗап.СтопВыгрузка Тогда
								СообщениеУведомления = СтрШаблон("Витрина по маркет плейсу %1 выключена по причине:
								|Достижение ежедневного лимита по количеству заказов.", МаркПл.Наименование)
							Иначе
								СообщениеУведомления = СтрШаблон("Витрина по маркет плейсу %1 включена!", МаркПл.Наименование)
							КонецЕсли;
							
							ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателейУведомленийОбИзмененииВитрины,
								ТемаУведомления, СообщениеУведомления);
						КонецЕсли;
						// Ихсанов Д. А. Конец 16.10.2025
						
					Иначе
												
						//на всякий случай , еще раз продублируем
						//если Текущая дата > (больше СТОП ДАТА) тогда обнулится
						//если постатвить СТОПДАТА заведомо больше то выгрузки не будет
						
						Если НачалоДня(ТекущаяДатаСеанса()) > НачалоДня(Результат.СтопДата)  Тогда
							
							НовЗап.СтопВыгрузка =  Ложь;
							НовЗап.СтопДата     =  Дата(1,1,1);  					
							
						КонецЕсли;     
						
						//Тимофеев Ю.А. 060824
						//Если не выполнен план на день нужно обнулить витрины в любом случаю до утра
						
						Если  ЭтоОФис Тогда
							ВремяЗакрытия=100; //ценральный склад работает круглостуочно
						Иначе
							ВремяЗакрытия=20;
						КонецЕсли;
						
						
						Если Час(ТекущаяДата())>ВремяЗакрытия и НовЗап.СтопВыгрузка = Ложь Тогда 	
							
							ужеЗаказов              = НовЗап.Загружено;						 					
							НовЗап.СтопВыгрузка     = Истина;
							НовЗап.СтопДата         = ТекущаяДатаСеанса();
							НовЗап.Загружено        = 0;
							НаборЗаписей.Записать();
							
							ЗаписатьВЛог("МаркетПлейс_контроль заказов",Строка(КодМаркетплейса)+" СТОП ВЫГРУЗКА-превыщено время ожидания "+Строка(ужеЗаказов),"Информация");
							
							//запустим обнуление остатков если СТОПВЫГРУЗКА =ИСТИНА, то все с 0 выгрузятся
							ВыгрузкаОстатковнаВитрину(МаркПл,КодМаркетплейса);
							
							// Ихсанов Д. А. Начало 06.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2235
							// Зафиксируем условный результат выполнения регламента
							Если ЗначениеЗаполнено(КодСтатусаЗадания) И ЗначениеЗаполнено(ИмяПроцедурыЗадания) Тогда
								СтруктураДанныхЗадания.Вставить("СтопДата", КонецДня(ТекущаяДатаСеанса()) + 1);
								ОбменМаркетПлейс.ПроверкаРазрешенияНаЗапускРегламентногоЗадания(СтруктураДанныхЗадания, Истина);
							КонецЕсли;
							// Ихсанов Д. А. Конец  06.04.2025
							
						КонецЕсли;
						
						// Ихсанов Д. А. Начало 16.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2519
						Если ФлагСтопВыгрузка <> НовЗап.СтопВыгрузка
							И СписокПолучателейУведомленийОбИзмененииВитрины.Количество() > 0 Тогда
							ТемаУведомления = СтрШаблон("%1. Информация по обновлению витрины.", МаркПл.Наименование);
							Если НовЗап.СтопВыгрузка Тогда
								СообщениеУведомления = СтрШаблон("Витрина по маркет плейсу %1 выключена по причине:
								|Достижение времени закрытия склада.", МаркПл.Наименование)
							Иначе
								СообщениеУведомления = СтрШаблон("Витрина по маркет плейсу %1 включена!", МаркПл.Наименование)
							КонецЕсли;
							
							ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателейУведомленийОбИзмененииВитрины,
								ТемаУведомления, СообщениеУведомления);
						КонецЕсли;
						// Ихсанов Д. А. Конец 16.10.2025
						
						//Тимофеев Ю.А. 060824   
						
					КонецЕсли;
					
					НаборЗаписей.Записать();  				
					
				КонецЦикла; 
				
			Иначе
				//максимум заданий равно 0 . Остановим витрину , если она включена
				
				НаборЗаписей = РегистрыСведений.СтатусФоновогоЗадания.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.КОД.Установить(Результат.Код);
				НаборЗаписей.Отбор.ИмяПроцедуры.Установить(Результат.ИмяПроцедуры);	
				НаборЗаписей.Прочитать();
				
				Для каждого НовЗап из НаборЗаписей Цикл
					
					// Ихсанов Д. А. Начало 16.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2519
					ФлагСтопВыгрузка = НовЗап.СтопВыгрузка;
					// Ихсанов Д. А. Конец 16.10.2025
					
					Если НовЗап.СтопВыгрузка = Ложь Тогда 	
						
						ужеЗаказов              = НовЗап.Загружено;						 					
						НовЗап.СтопВыгрузка     = Истина;
						НовЗап.СтопДата         = ТекущаяДатаСеанса();
						НовЗап.Загружено        = 0;
						НаборЗаписей.Записать();
						
						ЗаписатьВЛог("WB_контроль заказов",Строка(КодМаркетплейса)+" СТОП ВЫГРУЗКА- МАКС.КОЛВО для выгрузки =0 "+Строка(ужеЗаказов),"Информация");
						
						//запустим обнуление остатков если СТОПВЫГРУЗКА =ИСТИНА, то все с 0 выгрузятся
						
						ВыгрузкаОстатковнаВитрину(МаркПл,КодМаркетплейса);
						
						// Ихсанов Д. А. Начало 06.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2235
						// Зафиксируем условный результат выполнения регламента
						Если ЗначениеЗаполнено(КодСтатусаЗадания) И ЗначениеЗаполнено(ИмяПроцедурыЗадания) Тогда
							СтруктураДанныхЗадания.Вставить("СтопДата", КонецДня(ТекущаяДатаСеанса()) + 1);
							ОбменМаркетПлейс.ПроверкаРазрешенияНаЗапускРегламентногоЗадания(СтруктураДанныхЗадания, Истина);
						КонецЕсли;
						// Ихсанов Д. А. Конец  06.04.2025
												
					КонецЕсли;
					
					// Ихсанов Д. А. Начало 16.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2519
					Если ФлагСтопВыгрузка <> НовЗап.СтопВыгрузка
						И СписокПолучателейУведомленийОбИзмененииВитрины.Количество() > 0 Тогда
						ТемаУведомления = СтрШаблон("%1. Информация по обновлению витрины.", МаркПл.Наименование);
						Если НовЗап.СтопВыгрузка Тогда
							СообщениеУведомления = СтрШаблон("Витрина по маркет плейсу %1 выключена по причине:
							|Достижение времени закрытия склада.", МаркПл.Наименование)
						Иначе
							СообщениеУведомления = СтрШаблон("Витрина по маркет плейсу %1 включена!", МаркПл.Наименование)
						КонецЕсли;
						
						ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателейУведомленийОбИзмененииВитрины,
							ТемаУведомления, СообщениеУведомления);
					КонецЕсли;
					// Ихсанов Д. А. Конец 16.10.2025
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли; 
		
		//Есть случаи в лист переукладки не добавляется ШК, Префикс и Суффикс Тимофеев Ю.А.23.07.24
		Попытка
			
			Если НЕ ЭтоОФис Тогда
				ЗаполинитьЛистыПереукладмиДаннымиШК();
			КонецЕсли;  		
			
		Исключение
			
		КонецПопытки;   		
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВыгрузкаОстатковнаВитрину(МаркПл,КодМаркетплейса)
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("Имя");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	НовСтр=ТаблицаПараметров.Добавить();
	НовСтр.Имя="ТЕСТ";
	НовСТр.Значение=Истина; 
	
	КодМаркетплейса =МаркПл.Код;
	
	Если КодМаркетплейса      = "00001" Тогда
		
		ОбменМаркетПлейс.ВыгрузкаОстатковВайлберриз(ТаблицаПараметров); 
		
	ИначеЕсли КодМаркетплейса = "00009" Тогда
		
		ОбменМаркетПлейс.ВыгрузкаОстатковВайлберриз_БКТ(ТаблицаПараметров);
		
	ИначеЕсли КодМаркетплейса = "00016" Тогда
		
		ОбменМаркетПлейс.ВыгрузкаОстатковВайлберриз_МПСтиль(ТаблицаПараметров);
		
	ИначеЕсли КодМаркетплейса = "00002" Тогда     //ОЗОН
		
		ОбменМаркетПлейс.ВыполнитьОбменСОзон(ТаблицаПараметров);
		
		// Ихсанов Д. А. Начало 01.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2125
	ИначеЕсли КодМаркетплейса = "00004" Тогда // Яндекс
		
		ОбменМаркетПлейс.МП_УНИВЕРСАЛЬНАЯ_ВыгрузкаОстатков_ЯндексМаркет(ТаблицаПараметров, МаркПл);
		
	ИначеЕсли КодМаркетплейса = "00014" Тогда // Магнит
		
		ОбменМаркетПлейс.МП_УНИВЕРСАЛЬНАЯ_ВыгрузкаОстатков_МагнитМаркет(ТаблицаПараметров, МаркПл);
		// Ихсанов Д. А. Конец 01.04.2025
			
	КонецЕсли;

		
КонецПроцедуры


Процедура ЗаполинитьЛистыПереукладмиДаннымиШК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛистПереукладкиТовары.Ссылка КАК Ссылка,
	|	ЛистПереукладкиТовары.Номенклатура КАК Номенклатура,
	|	ЛистПереукладкиТовары.Ссылка.Штрихкод КАК Штрихкод,
	|	ЛистПереукладкиТовары.Ссылка.ПрефиксЗаказа КАК ПрефиксЗаказа,
	|	ЛистПереукладкиТовары.Ссылка.СуффиксЗаказа КАК СуффиксЗаказа,
	|	ЛистПереукладкиТовары.Ссылка.ДокОснование КАК ДокОснование
	|ПОМЕСТИТЬ Основная
	|ИЗ
	|	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
	|ГДЕ
	|	ЛистПереукладкиТовары.Ссылка.Штрихкод = &Штрихкод
	|	И ЛистПереукладкиТовары.Ссылка.Дата МЕЖДУ &Дата И &Дата1
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛистПереукладкиТовары.Ссылка,
	|	ЛистПереукладкиТовары.Номенклатура,
	|	ЛистПереукладкиТовары.Ссылка.Штрихкод,
	|	ЛистПереукладкиТовары.Ссылка.ПрефиксЗаказа,
	|	ЛистПереукладкиТовары.Ссылка.СуффиксЗаказа,
	|	ЛистПереукладкиТовары.Ссылка.ДокОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ДокОснование КАК ДокОснование
	|ПОМЕСТИТЬ РНК
	|ИЗ
	|	Основная КАК Основная
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ДокОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	|	ЗаказКлиентаFBSТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	|	ЗаказКлиентаFBSТовары.СуффиксЗаказа КАК СуффиксЗаказа,
	|	ЗаказКлиентаFBSТовары.Ссылка.ДокОснование КАК ДокОснование,
	|	ЗаказКлиентаFBSТовары.Ссылка КАК Ссылка,
	|	ЗаказКлиентаFBSТовары.ЛистПереукладки КАК ЛистПереукладки
	|ПОМЕСТИТЬ ЗАКАЗ
	|ИЗ
	|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка.ДокОснование В
	|			(ВЫБРАТЬ
	|				РНК.ДокОснование КАК ДокОснование
	|			ИЗ
	|				РНК КАК РНК)
	|	И ЗаказКлиентаFBSТовары.Ссылка.Дата МЕЖДУ &Дата0 И &Дата1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.Ссылка КАК ЛистПереукладки,
	|	Основная.Номенклатура КАК Номенклатура,
	|	Основная.ДокОснование КАК ДокОснование,
	|	ЗАКАЗ.ШтрихКод КАК ШтрихКод,
	|	ЗАКАЗ.ПрефиксЗаказа КАК ПрефиксЗаказа,
	|	ЗАКАЗ.СуффиксЗаказа КАК СуффиксЗаказа,
	|	ЗАКАЗ.Ссылка КАК ЗаказФБС
	|ИЗ
	|	Основная КАК Основная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗАКАЗ КАК ЗАКАЗ
	|		ПО Основная.Номенклатура = ЗАКАЗ.Номенклатура
	|			И Основная.ДокОснование = ЗАКАЗ.ДокОснование
	|			И Основная.Ссылка = ЗАКАЗ.ЛистПереукладки";
	//Параметры запроса
	НачПериода = НачалоДня(ТекущаяДата());
	КонПериода = ТекущаяДата();
	
	
	Запрос.УстановитьПараметр("Дата", НачПериода);// Дата
	Запрос.УстановитьПараметр("Дата1",КонПериода);// Дата
	
	Дата0= НачПериода - 86400*2;
	
	Запрос.УстановитьПараметр("Дата0",Дата0);// Дата
	
	Запрос.УстановитьПараметр("Штрихкод","");// Строка
	Результат = Запрос.Выполнить().Выгрузить();
	
	//Параметры запроса
	Запрос.УстановитьПараметр("Дата", НачПериода);// Дата
	Запрос.УстановитьПараметр("Дата1",КонПериода);// Дата
	Запрос.УстановитьПараметр("Штрихкод","");// Строка
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()>0 Тогда
		
		ЗаписатьВЛог("WB_контроль заказов"," Лист переукладки добавили ШК "+Строка(Результат.Количество()),"Информация");
		
		
		
		Для Каждого СтрЛП  из Результат Цикл
			
			ЛистПереукладки = СтрЛП.ЛистПереукладки;
			
			Если ЗначениеЗаполнено(СтрЛП.Штрихкод) Тогда
				
				ОбЛистПереукладки = ЛистПереукладки.ПолучитьОбъект();
				
				ОбЛистПереукладки.Штрихкод     = СтрЛП.Штрихкод;
				ОбЛистПереукладки.ПрефиксЗаказа= СтрЛП.ПрефиксЗаказа;
				ОбЛистПереукладки.СуффиксЗаказа= СтрЛП.СуффиксЗаказа;
				
				ОбЛистПереукладки.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры



Функция ВсегоЗаказовЗаСегодня(МаркетПлейс)
	
	// Ихсанов Д. А. Начало 29.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2482
	// Доработка запроса под забор данных с ПЗК
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа
	|ПОМЕСТИТЬ вт_ДанныеПоЗаказам
	|ИЗ
	|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
	|	И ЗаказКлиентаFBSТовары.Ссылка.Проведен
	|	И ЗаказКлиентаFBSТовары.Ссылка.Контрагент = &Контрагент
	|	И ЗаказКлиентаFBSТовары.Ссылка.Проведен
	|	И ЗаказКлиентаFBSТовары.Ссылка.ДокОснование.Договор = &Договор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредварительныйЗаказКлиентаТовары.НомерЗаказа
	|ИЗ
	|	Документ.ПредварительныйЗаказКлиента.Товары КАК ПредварительныйЗаказКлиентаТовары
	|ГДЕ
	|	ПредварительныйЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
	|	И ПредварительныйЗаказКлиентаТовары.Ссылка.Проведен
	|	И ПредварительныйЗаказКлиентаТовары.Ссылка.Контрагент = &Контрагент
	|	И ПредварительныйЗаказКлиентаТовары.Ссылка.Проведен
	|	И ПредварительныйЗаказКлиентаТовары.Ссылка.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_ДанныеПоЗаказам.НомерЗаказа) КАК КоличествоЗаказов   
	|ИЗ
	|	вт_ДанныеПоЗаказам КАК вт_ДанныеПоЗаказам";
	//Параметры запроса
	Запрос.УстановитьПараметр("Договор",   МаркетПлейс.Договор);// Договоры
	Запрос.УстановитьПараметр("Контрагент",МаркетПлейс.Контрагент);// Контрагенты
	Запрос.УстановитьПараметр("НачДата",   НачалоДня(ТекущаяДатаСеанса()));// Дата
	Запрос.УстановитьПараметр("КонДата",   КонецДня(ТекущаяДатаСеанса()));// Дата
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.КоличествоЗаказов;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
